#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

&Перед("ЗаполнитьТаблицуТоваров")
Процедура рвк_ЗаполнитьТаблицуТоваров(РезультатЗаполнения) Экспорт

	Если Не РезультатЗаполнения.Корректировочный Тогда
		Возврат;
	КонецЕсли;

	ТаблицыТоваровДокументаОснование = ТаблицыТоваровДокументаОснование();
	Для Каждого СтрокаТовары Из РезультатЗаполнения.Товары Цикл
		ВидОперации = ?(ЗначениеЗаполнено(СтрокаТовары.КоличествоУвеличение), "Списание", "Оприходование");
		Отбор = Новый Структура;
		Отбор.Вставить("ВидОперации", ВидОперации);
		Отбор.Вставить("Номенклатура", СтрокаТовары.Номенклатура);
		СтрокиДокументаОснования = ТаблицыТоваровДокументаОснование.НайтиСтроки(Отбор);
		Если Не ЗначениеЗаполнено(СтрокиДокументаОснования) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДокументаОснования = СтрокиДокументаОснования[0];
		Если ВидОперации = "Списание" И СтрокаТовары.КоличествоУвеличение > СтрокаДокументаОснования.Количество Тогда
			СтрокаТовары.КоличествоУвеличение = СтрокаДокументаОснования.Количество;
			СтрокаТовары.СуммаУвеличение = СтрокаТовары.СуммаУвеличение / 2;
			СтрокаТовары.СуммаНДСУвеличение = СтрокаТовары.СуммаНДСУвеличение / 2;
			
			СтрокаТовары.Количество = СтрокаТовары.Количество + СтрокаДокументаОснования.Количество; 
			СтрокаТовары.СуммаНДС = СтрокаТовары.СуммаНДС + СтрокаТовары.СуммаНДСУвеличение;
			СтрокаТовары.Сумма = СтрокаТовары.Сумма + СтрокаТовары.СуммаУвеличение;
		ИначеЕсли ВидОперации = "Оприходование" Тогда
			СтрокаТовары.КоличествоУменьшение = СтрокаДокументаОснования.Количество;
			СтрокаТовары.СуммаУменьшение = СтрокаТовары.СуммаУменьшение / 2;
			СтрокаТовары.СуммаНДСУменьшение = СтрокаТовары.СуммаНДСУменьшение / 2;
			
			СтрокаТовары.Количество = СтрокаТовары.Количество - СтрокаДокументаОснования.Количество;
			СтрокаТовары.СуммаНДС = СтрокаТовары.СуммаНДС - СтрокаТовары.СуммаНДСУменьшение;
			СтрокаТовары.Сумма = СтрокаТовары.Сумма - СтрокаТовары.СуммаУменьшение;
		КонецЕсли;
	КонецЦикла;

	//TODO: Вставить содержимое обработчика
КонецПроцедуры

Функция ТаблицыТоваровДокументаОснование()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КорректировкаРеализацииВидыЗапасовОприходование.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(КорректировкаРеализацииВидыЗапасовОприходование.Количество) КАК Количество,
		|	СУММА(КорректировкаРеализацииВидыЗапасовОприходование.СуммаСНДС) КАК СуммаСНДС,
		|	СУММА(КорректировкаРеализацииВидыЗапасовОприходование.СуммаНДС) КАК СуммаНДС,
		|	""Оприходование"" КАК ВидОперации
		|ИЗ
		|	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК КорректировкаРеализацииВидыЗапасовОприходование
		|ГДЕ
		|	КорректировкаРеализацииВидыЗапасовОприходование.Ссылка = &ДокументОснование
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаРеализацииВидыЗапасовОприходование.АналитикаУчетаНоменклатуры.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаРеализацииВидыЗапасовСписание.АналитикаУчетаНоменклатуры.Номенклатура,
		|	СУММА(КорректировкаРеализацииВидыЗапасовСписание.Количество),
		|	СУММА(КорректировкаРеализацииВидыЗапасовСписание.СуммаСНДС),
		|	СУММА(КорректировкаРеализацииВидыЗапасовСписание.СуммаНДС),
		|	""Списание""
		|ИЗ
		|	Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК КорректировкаРеализацииВидыЗапасовСписание
		|ГДЕ
		|	КорректировкаРеализацииВидыЗапасовСписание.Ссылка = &ДокументОснование
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаРеализацииВидыЗапасовСписание.АналитикаУчетаНоменклатуры.Номенклатура";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли