#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

&Перед("ЗаполнитьТаблицуТоваров")
Процедура рвк_ЗаполнитьТаблицуТоваров(РезультатЗаполнения) Экспорт

	Если Не РезультатЗаполнения.Корректировочный Тогда
		Возврат;
	КонецЕсли;

	ТаблицыТоваровДокументаОснование = ТаблицыТоваровДокументаОснование();
	Для Каждого СтрокаТовары Из РезультатЗаполнения.Товары Цикл
		ВидОперации = ?(ЗначениеЗаполнено(СтрокаТовары.КоличествоУвеличение), "Списание", "Оприходование");
		Отбор = Новый Структура;
		Отбор.Вставить("ВидОперации", ВидОперации);
		Отбор.Вставить("Номенклатура", СтрокаТовары.Номенклатура);
		СтрокиДокументаОснования = ТаблицыТоваровДокументаОснование.НайтиСтроки(Отбор);
		Если Не ЗначениеЗаполнено(СтрокиДокументаОснования) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДокументаОснования = СтрокиДокументаОснования[0];
		Коэффициент = 0;
		Если ВидОперации = "Списание" И СтрокаТовары.КоличествоУвеличение > СтрокаДокументаОснования.Количество Тогда
			Коэффициент = СтрокаТовары.КоличествоУвеличение / СтрокаДокументаОснования.Количество;
			СтрокаТовары.КоличествоУвеличение = СтрокаТовары.КоличествоУвеличение / Коэффициент;
			СтрокаТовары.СуммаУвеличение = СтрокаТовары.СуммаУвеличение / Коэффициент;
			СтрокаТовары.СуммаНДСУвеличение = СтрокаТовары.СуммаНДСУвеличение / Коэффициент;
		ИначеЕсли ВидОперации = "Оприходование"  И СтрокаТовары.КоличествоУменьшение > СтрокаДокументаОснования.Количество Тогда
			Коэффициент = СтрокаТовары.КоличествоУменьшение / СтрокаДокументаОснования.Количество;
			СтрокаТовары.СуммаУменьшение = СтрокаТовары.СуммаУменьшение / Коэффициент;
			СтрокаТовары.СуммаНДСУменьшение = СтрокаТовары.СуммаНДСУменьшение / Коэффициент;
			СтрокаТовары.КоличествоУменьшение = СтрокаТовары.КоличествоУменьшение / Коэффициент;
		КонецЕсли;

		Если ЗначениеЗаполнено(Коэффициент) Тогда
			СтрокаТовары.Количество = СтрокаТовары.Количество / Коэффициент;
			СтрокаТовары.СуммаНДС = СтрокаТовары.СуммаНДС / Коэффициент;
			СтрокаТовары.Сумма = СтрокаТовары.Сумма / Коэффициент;
		КонецЕсли;

	КонецЦикла;

	//TODO: Вставить содержимое обработчика
КонецПроцедуры

Функция ТаблицыТоваровДокументаОснование()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КорректировкаРеализацииВидыЗапасовОприходование.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(КорректировкаРеализацииВидыЗапасовОприходование.Количество) КАК Количество,
		|	СУММА(КорректировкаРеализацииВидыЗапасовОприходование.СуммаСНДС) КАК СуммаСНДС,
		|	СУММА(КорректировкаРеализацииВидыЗапасовОприходование.СуммаНДС) КАК СуммаНДС,
		|	""Оприходование"" КАК ВидОперации
		|ИЗ
		|	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК КорректировкаРеализацииВидыЗапасовОприходование
		|ГДЕ
		|	КорректировкаРеализацииВидыЗапасовОприходование.Ссылка = &ДокументОснование
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаРеализацииВидыЗапасовОприходование.АналитикаУчетаНоменклатуры.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаРеализацииВидыЗапасовСписание.АналитикаУчетаНоменклатуры.Номенклатура,
		|	СУММА(КорректировкаРеализацииВидыЗапасовСписание.Количество),
		|	СУММА(КорректировкаРеализацииВидыЗапасовСписание.СуммаСНДС),
		|	СУММА(КорректировкаРеализацииВидыЗапасовСписание.СуммаНДС),
		|	""Списание""
		|ИЗ
		|	Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК КорректировкаРеализацииВидыЗапасовСписание
		|ГДЕ
		|	КорректировкаРеализацииВидыЗапасовСписание.Ссылка = &ДокументОснование
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаРеализацииВидыЗапасовСписание.АналитикаУчетаНоменклатуры.Номенклатура";

	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#КонецЕсли
