
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьГраницуПоследовательностиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбновитьГраницуПоследовательности", 5, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГраницуПоследовательности() Экспорт
	ОбновитьГраницуПоследовательностиНаСервере();
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВосстановитьПоследовательность(Команда)
	ВосстановитьПоследовательностьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВариантыОтчетов(Команда)
	ОбновитьВариантыОтчетовНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьГраницуПоследовательностиНаСервере()
	ГраницаПоследовательности = усУправлениеПоследовательностью.ГраницаПоследовательности();
КонецПроцедуры

&НаСервере
Процедура ВосстановитьПоследовательностьНаСервере()
	
	Результат = усУправлениеПоследовательностью.ВосстановитьПоследовательность();
	Если Результат.Отказ Тогда
	    ОбщегоНазначения.СообщитьПользователю("Ошибка восстановления последовательности, по причине: " + Результат.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ОбновитьГраницуПоследовательностиНаСервере();
	ОбщегоНазначения.СообщитьПользователю("Последовательность успешно восстановлена");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьВариантыОтчетовНаСервере()
	ВариантыОтчетов.Обновить();
КонецПроцедуры

#КонецОбласти