
&Вместо("УстановитьВидимостьПоЗаказам")
&НаСервере
Процедура рвк_УстановитьВидимостьПоЗаказам()

	Если Элементы.Найти("ТоварыДобавить") <> Неопределено Тогда
		Если Объект.ПродажаПоЗаказам Тогда
			Элементы.ТоварыДобавить.Заголовок = НСтр("ru='Добавить товары сверх заказа'");
		Иначе
			Элементы.ТоварыДобавить.Заголовок = НСтр("ru='Добавить'");
		КонецЕсли;
	КонецЕсли;

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТоварыПодобратьТоварыИзЗаказа", "Видимость", Объект.ПродажаПоЗаказам);

КонецПроцедуры
