#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

&После("ОбработкаУдаленияПроведения")
Процедура усОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	усОстаткиПоПартиям.Регистратор,
		|	усОстаткиПоПартиям.МоментВремени КАК МоментВремени
		|ИЗ
		|	РегистрНакопления.усОстаткиПоПартиям КАК усОстаткиПоПартиям
		|ГДЕ
		|	усОстаткиПоПартиям.Партия = &Партия
		|
		|УПОРЯДОЧИТЬ ПО
		|	МоментВремени";
	
	Запрос.УстановитьПараметр("Партия", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Регистратор = Выборка.Регистратор;
		РезультатДобавитьДвиженияОстаткиПоПартиям = усУправлениеСебестоимостью.ДобавитьДвиженияОстаткиПоПартиям(Регистратор);
		Если РезультатДобавитьДвиженияОстаткиПоПартиям.Отказ Тогда
			ОбщегоНазначения.СообщитьПользователю(РезультатДобавитьДвиженияОстаткиПоПартиям.ТекстОшибки);
			Прервать;
		КонецЕсли;
		усУправлениеПродажами.ДобавитьДвиженияПродажи(Регистратор);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли