#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтррКонтекст = Новый Структура("Значения");
	ТекОбъект = РеквизитФормыВЗначение("Объект");		
	ТекОбъект.КонтекстФормыИнициализировать(СтррКонтекст, Параметры);
	
	Если Не Параметры.Свойство("Значения") Тогда
		//@skip-check form-self-reference
		ВызватьИсключение("Форма """ + ЭтаФорма.Заголовок + """ - отсутствует свойство Параметр.Значения.");
	КонецЕсли; 
	
	//@skip-check unknown-form-parameter-access
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.Значения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПредставлениеКоординат();
КонецПроцедуры

// ОбработчикиСобытийФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШиротаПриИзменении(Элемент)
	ОбновитьПредставлениеКоординат();
КонецПроцедуры

&НаКлиенте
Процедура ДолготаПриИзменении(Элемент)
	ОбновитьПредставлениеКоординат();
КонецПроцедуры

// ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЗаполнитьЗначенияСвойств(СтррКонтекст.Значения, ЭтотОбъект);
	Закрыть(СтррКонтекст.Значения);
	
КонецПроцедуры

// ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПредставлениеКоординат()
	Элементы.ДекорацияШирота.Заголовок  = NMEAвСтроку(Широта);
	Элементы.ДекорацияДолгота.Заголовок = NMEAвСтроку(Долгота);
КонецПроцедуры

// Возвращает строку-представление координат в читабельном для пользователя виде.
// Координаты передаются в формате NMEA.
&НаКлиентеНаСервереБезКонтекста
Функция NMEAвСтроку(Коор)
	
	Часы = Цел(Коор / 100);
	Минуты = Цел(Коор - 100*Часы);
	Секунды = Окр((Коор - Цел(Коор))*60, 2);
	ЧСтр = Строка(Часы);
	МСтр = Формат(Минуты, "ЧЦ=2;ЧВН=;ЧН=");
	ССтр = Формат(Секунды, "ЧЦ=4;ЧДЦ=2;ЧРД=.;ЧВН=;ЧН=");
	
	Возврат ЧСтр + "°" + МСтр + "'" + ССтр + """";
	
КонецФункции

// СлужебныеПроцедурыИФункции
#КонецОбласти
