
#Область ПрограммныйИнтерфейс

// Заполняет РегламентированныйОтчетБухОтчетность по форме ФормаОтчета2025Кв1.
//
// Параметры:
//  ПараметрыОтчета - Структура - набор именованных параметров для определения вариантов заполнения отчета.
//  Контейнер - ДеревоЗначений - данные разделов.
//
Процедура ЗаполнитьОтчетБухОтчетностьФормаОтчета2025Кв1(ПараметрыОтчета, Контейнер) Экспорт

	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Контейнер", Контейнер);
	
	ПоместитьВоВременноеХранилище(СтруктураДанных, ПараметрыОтчета.АдресВоВременномХранилище);
	
КонецПроцедуры

#КонецОбласти