
#Область СлужебныеПроцедурыИФункции

&Перед("ВыполнитьКонтрольРезультатовПроведения")
Процедура рвк_ВыполнитьКонтрольРезультатовПроведения(Механизмы, Документ, МенеджерВременныхТаблиц, Отказ)

	ОтключитьКонтрольПриПроведении = Ложь;
	Если Документ.ДополнительныеСвойства.Свойство("ОтключитьКонтрольПриПроведении", ОтключитьКонтрольПриПроведении)
			И ОтключитьКонтрольПриПроведении = Истина Тогда

		СписокОтключаемыхМеханизмов = Новый Массив();
		СписокОтключаемыхМеханизмов.Добавить("ОперативныйУчетТоваровОрганизаций");
		СписокОтключаемыхМеханизмов.Добавить("Взаиморасчеты");
		СписокОтключаемыхМеханизмов.Добавить("Закупки");
		СписокОтключаемыхМеханизмов.Добавить("Обеспечение");
		СписокОтключаемыхМеханизмов.Добавить("ОформлениеОтчетовКомитентуОЗакупках");
		СписокОтключаемыхМеханизмов.Добавить("ПриемНаОтветхранение");
		СписокОтключаемыхМеханизмов.Добавить("Закупки");

		СписокУдаляемых = Новый Массив();

		Для Каждого ЭлементСписка Из Механизмы Цикл
			Если СписокОтключаемыхМеханизмов.Найти(ЭлементСписка.Представление) <> Неопределено Тогда
				СписокУдаляемых.Добавить(ЭлементСписка);
			КонецЕсли;
		КонецЦикла;

		Для Каждого ЭлементСписка Из СписокУдаляемых Цикл
			Механизмы.Удалить(ЭлементСписка);
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
