
&НаСервере
Функция ПечатьНаСервере()
	
	мДок = Новый Массив;
	мДок.Добавить(Объект.СсылкаНаОбъект);
	мСп = Новый СписокЗначений;
	мСп.Вставить(0,Объект.СсылкаНаОбъект);
	СтруктураТипов = Новый Соответствие;
	СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг",мДок);
	
	ПараметрыПечати = Новый Структура("ВыводитьГТД,ВыводитьУслуги",Ложь,Ложь);
	
	Возврат РеквизитФормыВЗначение("Объект").СформироватьПечатнуюФормуТОРГ12(СтруктураТипов,мСп,ПараметрыПечати);
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
	//Объект.СсылкаНаОбъект = ЗапоминаемыйДокумент;
	
	ТабДок = ПечатьНаСервере();
	ТабДок.Показать();
	
	
КонецПроцедуры


&НаСервере
Функция СформироватьСчетФактуруНаСервере()
	
	мДок = Новый Массив;
	мДок.Добавить(Объект.СсылкаНаОбъект);
	мСп = Новый СписокЗначений;
	мСп.Вставить(0,Объект.СсылкаНаОбъект);
	СтруктураТипов = Новый Соответствие;
	СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг",мДок);
	
	ПараметрыПечати = Новый Структура("ВыводитьГТД,ВыводитьУслуги,ПечатьВВалюте",Ложь,Ложь,Ложь);
	
	Возврат РеквизитФормыВЗначение("Объект").СформироватьПечатнуюФормуСчетФактура(СтруктураТипов,мСп,ПараметрыПечати);
	
КонецФункции


&НаКлиенте
Процедура СформироватьСчетФактуру(Команда)
	
	ТабДок = СформироватьСчетФактуруНаСервере();
	ТабДок.Показать();
	
КонецПроцедуры


&НаСервере
Функция СформироватьСчетНаСервере()
	
	мДок = Новый Массив;
	мДок.Добавить(Объект.СсылкаНаОбъект);
	мСп = Новый СписокЗначений;
	мСп.Вставить(0,Объект.СсылкаНаОбъект);
	СтруктураТипов = Новый Соответствие;
	СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг",мДок);
	
	ПараметрыПечати = Новый Структура("ВыводитьГТД,ВыводитьУслуги,ПечатьВВалюте",Ложь,Ложь,Ложь);
	
	Возврат РеквизитФормыВЗначение("Объект").СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов,мСп,ПараметрыПечати);
	
КонецФункции


&НаКлиенте
Процедура СформироватьСчет(Команда)
	ТабДок = СформироватьСчетНаСервере();
	ТабДок.Показать();
КонецПроцедуры

