
&НаКлиенте
Процедура Отладка(Команда)
	
	ПечатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере()
	
	     МассивОбъектов = Новый Массив;
		 МассивОбъектов.Добавить(Объект.СсылкаНаОбъект);
		 КоллекцияПечатныхФорм = ПодготовитьКоллекциюПечатныхФорм("Макет");
		 ОбъектыПечати = Новый СписокЗначений;
		 ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
		 
		 ОбъектОбработка = РеквизитФормыВЗначение("Объект");
		 ОбъектОбработка.Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры

Функция ПодготовитьКоллекциюПечатныхФорм(Знач Идентификаторы)
	
	Результат = Новый ТаблицаЗначений;
	Для Каждого ИмяКолонки Из УправлениеПечатьюКлиентСервер.ИменаПолейКоллекцииПечатныхФорм() Цикл
		Результат.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;
	
	Если ТипЗнч(Идентификаторы) = Тип("Строка") Тогда
		Идентификаторы = СтрРазделить(Идентификаторы, ",");
	КонецЕсли;
	
	Для Каждого Идентификатор Из Идентификаторы Цикл
		ПечатнаяФорма = Результат.Найти(Идентификатор, "ИмяМакета");
		Если ПечатнаяФорма = Неопределено Тогда
			ПечатнаяФорма = Результат.Добавить();
			ПечатнаяФорма.ИмяМакета = Идентификатор;
			ПечатнаяФорма.ИмяВРЕГ = ВРег(Идентификатор);
			ПечатнаяФорма.Экземпляров = 1;
		Иначе
			ПечатнаяФорма.Экземпляров = ПечатнаяФорма.Экземпляров + 1;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Индексы.Добавить("ИмяВРЕГ");
	Возврат Результат;
	
КонецФункции