
&НаСервере
Процедура рвк_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Отборы = Параметры.Отбор; // Структура
	ХозяйственнаяОперация = Отборы.ХозяйственнаяОперация;
	Отборы.Удалить("ХозяйственнаяОперация");

	ШаблонЗаголовка = НСтр("ru='Выбор статьи ДДС для операции ""%1""'");
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка, ХозяйственнаяОперация);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокПоХозяйственнойОперации,
			"ХозяйственныеОперации.ХозяйственнаяОперация",
			ХозяйственнаяОперация,
			ВидСравненияКомпоновкиДанных.Равно,
			,
			Истина);

	РежимВыбора = "ПоХозОперации";
	// + Убрать после обновления
	//Элементы.СписокПоХозяйственнойОперацииВыбрать.КнопкаПоУмолчанию = Истина;
	// - Убрать после обновления

	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.СтатьиДвиженияДенежныхСредств) Тогда
		Элементы.РежимВыбора.Видимость = Ложь;
		Элементы.СписокПоХозяйственнойОперацииСкрытьОтВыбора.Видимость = Ложь;
	КонецЕсли;

	Элементы.СписокПоХозяйственнойОперации.ТекущаяСтрока = Параметры["ТекущаяСтрока"];

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// СтандартныеПодсистемы.БазоваяФункциональность
	МультиязычностьСервер.ИзменениеТекстаЗапросаСпискаДляТекущегоЯзыка(ЭтотОбъект, "СписокВсе");
	МультиязычностьСервер.ИзменениеТекстаЗапросаСпискаДляТекущегоЯзыка(ЭтотОбъект, "СписокПоХозяйственнойОперации");
	// Конец СтандартныеПодсистемы.БазоваяФункциональность

КонецПроцедуры
