#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция рвк_ПриобретениеИнтеркампани(РеализацияТоваровУслуг) Экспорт
	Результат = рвк_ОбщегоНазначения.ЗначениеСвойства(РеализацияТоваровУслуг, рвк_СвойстваПриобретениеИнтеркампани(), Неопределено);
	Возврат Результат;
КонецФункции

Процедура рвк_ОбновитьСсылкуНаПриобретение(Реализация, Приобретение) Экспорт

	ТаблицаСвойствИЗначений = УправлениеСвойствами.ЗначенияСвойств(Реализация, Ложь);
	СвойстваПриобретениеИнтеркампани = рвк_СвойстваПриобретениеИнтеркампани();
	СтрокаЗначенияСвойства = ТаблицаСвойствИЗначений.Найти(СвойстваПриобретениеИнтеркампани, "Свойство");

	Если СтрокаЗначенияСвойства = Неопределено Тогда
		СтрокаЗначенияСвойства = ТаблицаСвойствИЗначений.Добавить();
		СтрокаЗначенияСвойства.Свойство = СвойстваПриобретениеИнтеркампани;

	КонецЕсли;

	СтрокаЗначенияСвойства.Значение = рвк_ОбщегоНазначения.ИдентификаторОбъекта(Приобретение);
	СтрокаЗначенияСвойства.Представление = Приобретение;
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(Реализация, ТаблицаСвойствИЗначений);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция рвк_СвойстваПриобретениеИнтеркампани()
	ИмяСвойста = "ПриобретениеТоваровИнтеркампани_99632521ff87417294fd4853ca9e1654";
	Результат = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", ИмяСвойста);
	Если Не ЗначениеЗаполнено(Результат) Тогда
		ВызватьИсключение "Не обнаружено доп. свойство " + ИмяСвойста;
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли
