
Функция СведенияОВнешнейОбработке() Экспорт
	
    ПараметрыРегистрации = Новый Структура;
	
	ПараметрыРегистрации.Вставить("Вид", ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет()); 
	// Строка, вид обработки, один из возможных: «ДополнительнаяОбработка», «ДополнительныйОтчет», «ЗаполнениеОбъекта», «Отчет», «ПечатнаяФорма» или «СозданиеСвязанныхОбъектов»
	
	ПараметрыРегистрации.Вставить("Назначение", Новый Массив); 
	// Массив строк имен объектов метаданных в формате: <ИмяКлассаОбъектаМетаданного>.[ * | <ИмяОбъектаМетаданных>].
	// Например, «Документ.СчетЗаказ» или «Справочник.*». Примечание: параметр имеет смысл только для назначаемых обработок, для глобальных – не используется.
													
	ПараметрыРегистрации.Вставить("Наименование", "Сведения по партнерам"); 
	// Наименование обработки, которым будет заполнено наименование элемента справочника, краткое описание для идентификации обработки администратором.
	
	ПараметрыРегистрации.Вставить("Версия", "1.0"); // Версия обработки в формате <старший номер>.<младший номер> используется при загрузке обработок в информационную базу. Например: 1.0.
	
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь); 
	// Принимает значение Истина или Ложь, в зависимости от того, требуется ли устанавливать или отключать безопасный режим при исполнении обработки (отчета). Если Истина, обработка (отчет) будет запущена в безопасном режиме При этом в частности, не гарантируется корректная работа дополнительных обработок под пользователями без полных прав в тех случаях, когда обработка вызывает код конфигурации, который не рассчитан на работу в безопасном режиме (в том числе, неявно, когда срабатывает код модуля объекта и подписок на события при записи данных).
	// Более подробно о безопасном режиме см. документацию к платформе 1С:Предприятие.
	
    ПараметрыРегистрации.Вставить("Информация", "");
	// Краткая информация по обработке, описание обработки.
	
    ПараметрыРегистрации.Вставить("ВерсияБСП", "1.2.1.4");
	// Минимальная версия БСП, на которую рассчитывает код дополнительной обработки. Должна быть задана не младше 1.2.1.4. 
	// Номер версии БСП задается в формате «РР.ПП.ВВ.СС» (РР – старший номер редакции; ПП – младший номер редакции; ВВ – номер версии; СС – номер сборки).

	
    ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
                    "Сведения по партнерам",
                    "СведенияПоПартнерам",
                    ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы(),
                    Ложь,
                    "");
					
    ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	//Команды, поставляемые обработкой. Таблица значений с колонками:
	//	Представление – представление команды в пользовательском интерфейсе;
	//	Идентификатор – идентификатор команды; любая строка, уникальная в пределах данной обработки (отчета). *
	//	Использование – вариант запуска команды:
	//	● ОткрытиеФормы – открыть форму обработки;
	//	● ВызовКлиентскогоМетода – вызвать клиентскую экспортную процедуру из модуля формы обработки;
	//	● ВызовСерверногоМетода – вызвать серверную экспортную процедуру из модуля объекта обработки.
	//	● СценарийВБезопасномРежиме – вызвать  серверную экспортную функцию из модуля объекта для формирования сценария выполнения (специальный вариант запуска для использования программного интерфейса, расширяющего доступные разработчику дополнительной обработки операции, при выполнении дополнительной обработки в безопасном режиме, подробнее см. Расширение безопасного режима).
	//	ПоказыватьОповещение – Истина, если требуется показать оповещение при начале и при завершении работы обработки. Например, при запуске обработки без открытия формы.
	//	Модификатор – дополнительный модификатор команды. Используется для дополнительных обработок печатных форм на основе табличных макетов, для таких команд должен содержать строку ПечатьMXL (см. пример в демонстрационной конфигурации).	
	
    Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
    Команды = Новый ТаблицаЗначений;
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
    Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление = Представление;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = Использование;
    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
    НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

