#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура ус_ПриЗаписи(Отказ, Замещение)

	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Регистратор = Отбор.Регистратор.Значение;
	РезультатДобавитьДвиженияОстаткиПоПартиям = усУправлениеСебестоимостью.ДобавитьДвиженияОстаткиПоПартиям(Регистратор);
	Если РезультатДобавитьДвиженияОстаткиПоПартиям.Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю(РезультатДобавитьДвиженияОстаткиПоПартиям.ТекстОшибки,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли