Функция СведенияОВнешнейОбработке() Экспорт
    ПараметрыРегистрации = Новый Структура;
    МассивНазначений = Новый Массив;
    МассивНазначений.Добавить("Документ.РеализацияТоваровУслуг");
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма");
    ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
    ПараметрыРегистрации.Вставить("Наименование", "Договор разовой поставки");
    ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);
    ПараметрыРегистрации.Вставить("Версия", "1.0");    
    ПараметрыРегистрации.Вставить("Информация",  "Договор разовой поставки ");
    
    ТаблицаКоманд = ПолучитьТаблицуКоманд();
	

    ДобавитьКоманду(ТаблицаКоманд, "Договор разовой поставки", "Макет", "ВызовСерверногоМетода", Истина, "ПечатьОбщихФорм");
    ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
КонецФункции

Функция ПолучитьТаблицуКоманд()
  Команды = Новый ТаблицаЗначений;
  Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
  Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
  Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
  Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
  Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
  Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

  НоваяКоманда = ТаблицаКоманд.Добавить();
  НоваяКоманда.Представление = Представление;
  НоваяКоманда.Идентификатор = Идентификатор;
  НоваяКоманда.Использование = Использование;
  НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
  НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры

Процедура Печать(МассивОбъектов, КоллекцияпечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияпечатныхФорм,
	"Макет", "Макет",СформироватьПечатнуюФорму(МассивОбъектов[0], Объектыпечати));   
КонецПроцедуры

Функция СформироватьПечатнуюФорму(СсылкаНаДокумент, ОбъектыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПФ_ДОГОВОР_РАЗОВЫЙ";
	Макет = ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Партнер.НаименованиеПолное КАК ФИОПокуп,
		|	РеализацияТоваровУслуг.Номер КАК Номер,
		|	РеализацияТоваровУслуг.Дата КАК Дата,
		|	РеализацияТоваровУслуг.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО КонтрагентыКонтактнаяИнформация.Ссылка = РеализацияТоваровУслуг.Контрагент.Ссылка
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка
		|	И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();       	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьШапка.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
	КонецЦикла;      
	
	ТабДок.Вывести(ОбластьШапка);
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	ОбластьОсновной = Макет.ПолучитьОбласть("Основной");
	ОбластьОсновной.Параметры.Номер = СсылкаНаДокумент.Номер;
	ОбластьОсновной.Параметры.Дата = Формат(СсылкаНаДокумент.Дата, "ДФ=dd.MM.yyyy");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
		|	РеализацияТоваровУслуг.Валюта КАК Валюта,
		|	РеализацияТоваровУслуг.Организация.Наименование КАК ОрганизацияНаименование
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();                           
	                                                                              
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьОсновной.Параметры.ПредставлениеСуммы = 
			ФормированиеПечатныхФорм.СуммаРубКоп(ВыборкаДетальныеЗаписи.СуммаДокумента,ВыборкаДетальныеЗаписи.Валюта,ВыборкаДетальныеЗаписи.Валюта) + 
			"(" + ФормированиеПечатныхФорм.СуммаПлатежногоДокумента(ВыборкаДетальныеЗаписи.СуммаДокумента, Ложь) + ")" + ", с учетом НДС";
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьОсновной);
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
		|	РеализацияТоваровУслуг.БанковскийСчетОрганизации.Наименование КАК БанкСчетОргНаим,
		|	РеализацияТоваровУслуг.БанковскийСчетОрганизации.НомерСчета КАК БанкСчетОргНомерСчета,
		|	РеализацияТоваровУслуг.Организация.ИНН КАК ОргИНН,
		|	РеализацияТоваровУслуг.Организация.КПП КАК ОргКПП,
		|	РеализацияТоваровУслуг.Организация.ОГРН КАК ОргОГРН,
		|	РеализацияТоваровУслуг.БанковскийСчетОрганизации.КоррСчетБанка КАК КоррСчетБанк,
		|	РеализацияТоваровУслуг.БанковскийСчетОрганизации.БИКБанка КАК БанкСчетОргБИКБанк,
		|	РеализацияТоваровУслуг.Организация.НаименованиеСокращенное КАК ОргНаимСокращенное,
		|	РеализацияТоваровУслуг.Руководитель.ФизическоеЛицо.Фамилия КАК ФамилияРук,
		|	РеализацияТоваровУслуг.Руководитель.ФизическоеЛицо.Имя КАК ИмяРук,
		|	РеализацияТоваровУслуг.Руководитель.ФизическоеЛицо.Отчество КАК ОтчествоРук,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО РеализацияТоваровУслуг.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|	И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьПодвал.Параметры.НаименованиеОрг = ВыборкаДетальныеЗаписи.ОргНаимСокращенное;
		ОбластьПодвал.Параметры.ИНН = ВыборкаДетальныеЗаписи.ОргИНН;
		ОбластьПодвал.Параметры.КПП = ВыборкаДетальныеЗаписи.ОргКПП;
		ОбластьПодвал.Параметры.ОГРН = ВыборкаДетальныеЗаписи.ОргОГРН;
		ОбластьПодвал.Параметры.банк = ВыборкаДетальныеЗаписи.БанкСчетОргНаим;
		ОбластьПодвал.Параметры.ЮридАдрес = ВыборкаДетальныеЗаписи.АдресДоставки;
		ОбластьПодвал.Параметры.ФактАдрес = ВыборкаДетальныеЗаписи.АдресДоставки;
		ОбластьПодвал.Параметры.Бик = ВыборкаДетальныеЗаписи.БанкСчетОргБИКБанк;
		ОбластьПодвал.Параметры.РасчетСчет = ВыборкаДетальныеЗаписи.БанкСчетОргНомерСчета;
		ОбластьПодвал.Параметры.КорСчет = ВыборкаДетальныеЗаписи.КоррСчетБанк;
		ОбластьПодвал.Параметры.ЮридАдрес = ВыборкаДетальныеЗаписи.Представление; 
		ОбластьПодвал.Параметры.Фам = Лев(ВыборкаДетальныеЗаписи.ОтчествоРук,1) + ". " + Лев(ВыборкаДетальныеЗаписи.ИмяРук,1)+". "+ ВыборкаДетальныеЗаписи.ФамилияРук 
	КонецЦикла;
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
		|	РеализацияТоваровУслуг.Номер КАК Номер
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО (РеализацияТоваровУслуг.Организация.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка)
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|	И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации)";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьПодвал.Параметры.ФактАдрес = ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыКонтактнаяИнформация.Вид КАК Вид,
		|	КонтрагентыКонтактнаяИнформация.Представление КАК Представление,
		|	РеализацияТоваровУслуг.Контрагент.ИНН КАК ИНН,
		|	РеализацияТоваровУслуг.Партнер.НаименованиеПолное КАК ФИОПокуп
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|		ПО КонтрагентыКонтактнаяИнформация.Ссылка = РеализацияТоваровУслуг.Контрагент.Ссылка
		|			И (КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();       	
	ОбластьПодвал.Параметры.ДолжностьДирект = "Генеральный директор";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьПодвал.Параметры.ЮрАдресПост = ВыборкаДетальныеЗаписи.Представление;
		ОбластьПодвал.Параметры.ИННПост = ВыборкаДетальныеЗаписи.ИНН;
		ОбластьПодвал.Параметры.ФИОПокуп = ВыборкаДетальныеЗаписи.ФИОПокуп;
	КонецЦикла;                                                                  

	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Организация");
	ОбластьПодвал.Параметры.ЛицензияНомерОт = УправлениеСвойствами.ЗначениеСвойства(Организация, "ЛицензияФармацевтическая_4d3fdfa9248c4bd0996f209b9156d366");
			
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции