
&После("УстановитьДопСвойстваКонтролироватьОстаткиИФормироватьСторно")
Процедура рвк_УстановитьДопСвойстваКонтролироватьОстаткиИФормироватьСторно(ДокументОбъект, ПараметрыЗаполненияВидовЗапасов, МенеджерВременныхТаблиц)
	ДополнительныеСвойства = ДокументОбъект.ДополнительныеСвойства;
	ОтключитьКонтрольПриПроведении = Ложь;
	Если ДополнительныеСвойства.Свойство("ОтключитьКонтрольПриПроведении", ОтключитьКонтрольПриПроведении)
			И ОтключитьКонтрольПриПроведении Тогда
		ДополнительныеСвойства.Вставить("НужноКонтролироватьОстаткиТоваровОрганизаций", Ложь);
	КонецЕсли;
КонецПроцедуры
