
&НаСервере
Процедура РассчитатьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	усОстаткиПоПартиямОбороты.Регистратор КАК Регистратор,
		|	СУММА(усОстаткиПоПартиямОбороты.КоличествоОборот) КАК КоличествоОборот,
		|	усОстаткиПоПартиямОбороты.АналитикаУчетаНоменклатуры КАК Аналитика
		|ПОМЕСТИТЬ ВТ_Себестоимость
		|ИЗ
		|	РегистрНакопления.усОстаткиПоПартиям.Обороты(,, Регистратор,) КАК усОстаткиПоПартиямОбороты
		|СГРУППИРОВАТЬ ПО
		|	усОстаткиПоПартиямОбороты.Регистратор,
		|	усОстаткиПоПартиямОбороты.АналитикаУчетаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СебестоимостьТоваровОбороты.Регистратор КАК Регистратор,
		|	СебестоимостьТоваровОбороты.КоличествоОборот КАК КоличествоОборот,
		|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры КАК Аналитика
		|ПОМЕСТИТЬ ВТ_ОстаткиНаСколадах
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров.Обороты(,, Регистратор,) КАК СебестоимостьТоваровОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиНаСколадах.Регистратор КАК Регистратор,
		|	ВТ_ОстаткиНаСколадах.Аналитика КАК Аналитика,
		|	ВТ_ОстаткиНаСколадах.КоличествоОборот КАК КоличествоОборот,
		|	ВТ_Себестоимость.КоличествоОборот КАК КоличествоОборот1
		|ИЗ
		|	ВТ_ОстаткиНаСколадах КАК ВТ_ОстаткиНаСколадах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Себестоимость КАК ВТ_Себестоимость
		|		ПО ВТ_ОстаткиНаСколадах.Регистратор = ВТ_Себестоимость.Регистратор
		|		И ВТ_ОстаткиНаСколадах.Аналитика = ВТ_Себестоимость.Аналитика
		|ГДЕ
		|	ВТ_ОстаткиНаСколадах.КоличествоОборот <> ЕСТЬNULL(ВТ_Себестоимость.КоличествоОборот, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_ОстаткиНаСколадах.Регистратор.МоментВремени
		|ИТОГИ
		|ПО
		|	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоРегистратору = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоРегистратору.Следующий() Цикл
		Результат = усУправлениеПоследовательностью.СформироватьДвиженияРегистратора(ВыборкаПоРегистратору.Регистратор);
		Если Результат.Отказ Тогда
			ОбщегоНазначения.СообщитьПользователю("" + ВыборкаПоРегистратору.Регистратор + " Текст ошибки: " + Результат.ТекстОшибки);
		КонецЕсли;
//		Пока Выборка.Следующий() Цикл
//		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры
