
&НаКлиенте
Процедура КомандаОК(Команда)
	//
	стПараметры = Новый Структура;
	стПараметры.Вставить("НомерЛистаКниги",НомерЛистаКниги);
	стПараметры.Вставить("НомерСтрокиНачалоДанных",НомерСтрокиНачалоДанных);
	стПараметры.Вставить("Колонка_Идентификатора",Колонка_Идентификации);
	стПараметры.Вставить("Колонка_Цена", Колонка_Цена);
	стПараметры.Вставить("ВидИдентификации", ВидИдентификации);
	
	Если ОшибкиЗаполнения() Тогда
	
		Закрыть(Неопределено);
	
	Иначе
	
		Закрыть(стПараметры);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//
	НомерЛистаКниги=1;
	НомерСтрокиНачалоДанных=1;
	Колонка_Цена=2;
	
	ВидИдентификации = "Код";
	
КонецПроцедуры

&НаКлиенте
Функция ОшибкиЗаполнения()

	флОтказ = Ложь;
	
	Если Колонка_Идентификации = 0 Тогда
		
		Сообщить("ВНИМАНИЕ! Не указан № колонки с значением идентификации номенклатуры!");
		флОтказ = истина;
	
	КонецЕсли;
	
	Если Колонка_Цена=0 Тогда
		
		Сообщить("ОШИБКА! Не указан № колонки с ценой товаров!");
		флОтказ = истина;
	
	КонецЕсли;

	Возврат флОтказ;
	
КонецФункции
