#Область СлужебныйПрограммныйИнтерфейс

// Значение параметра.
//
// Параметры:
//  Параметр  - ПланВидовХарактеристикСсылка.усПараметрыПодсистемы
//  ЗначениеПоУмолчанию - Неопределено - Значение по умолчанию
//
// Возвращаемое значение:
//  Неопределено - Значение параметра
Функция ЗначениеПараметра(Параметр, Знач ЗначениеПоУмолчанию = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	усПараметрыПодсистемы.Значение
		|ИЗ
		|	РегистрСведений.усПараметрыПодсистемы КАК усПараметрыПодсистемы
		|ГДЕ
		|	усПараметрыПодсистемы.Параметр = &Параметр";

	Запрос.УстановитьПараметр("Параметр", Параметр);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗначениеПоУмолчанию = Выборка.Значение;
	КонецЕсли;

	Возврат ЗначениеПоУмолчанию;

КонецФункции

#КонецОбласти
