
&Вместо("НастроитьЭлементыФормы")
&НаСервере
Процедура рвк_НастроитьЭлементыФормы()
	Элементы.ГруппаПредставлениеДокументаОснования.Видимость       = ПоЗапросу;
	Элементы.ТоварыГруппаЗапрошеноНомерСтрокиКоличество.Видимость  = ПоЗапросу;
	Элементы.ТоварыНоменклатураПокупателяПредставление.Видимость   = ПоЗапросу;
	Элементы.ТоварыГруппаЗапрошеноКоличество.Видимость             = ПоЗапросу;
	Элементы.ТоварыЗапросЦена.Видимость                            = ПоЗапросу;
	Элементы.ГруппаИнформацияЗапрошеноПредложеноПоСтроке.Видимость = ПоЗапросу;
	Элементы.ТоварыПодобратьИзЗапроса.Видимость                    = ПоЗапросу;
	Элементы.ТоварыДобавитьПредложениеПоПозиции.Видимость          = ПоЗапросу;
	Элементы.ТоварыСкопироватьСтроки.Видимость                     = Не ПоЗапросу;
	Элементы.ТоварыВставитьСтроки.Видимость                        = Не ПоЗапросу;

	//Элементы.ТоварыДобавить.Видимость                              = Не ПоЗапросу;
	Элементы.ТоварыПоискПоШтрихкоду.Видимость                      = Не ПоЗапросу И НастройкиУчета.РеализованПоискПоШтрихкоду;
	Элементы.ТоварыРазбитьСтроку.Видимость                         = НастройкиУчета.РеализованоРазбиениеСтрок;
	Элементы.ТоварыЗагрузитьДанныеИзТСД.Видимость                  = НастройкиУчета.РеализованаЗагрузкаДанныхТСД;
	Элементы.ТоварыОткрытьПодбор.Видимость            = Не ПоЗапросу
	                                                    И НастройкиУчета.РеализованПодборНоменклатуры;
	Элементы.ТоварыЗагрузитьИзВнешнегоФайла.Видимость = Не ПоЗапросу
	                                                    И НастройкиУчета.РеализованоЗаполнениеДокументовИзВнешнегоФайла;

	Элементы.Организация.Видимость = Не НастройкиУчета.ИспользуетсяЕдинственнаяОрганизация;
	Элементы.Валюта.Видимость      = Не НастройкиУчета.ИспользуетсяЕдинственнаяВалюта;

	Элементы.Клиент.Видимость         = НастройкиУчета.ИспользуютсяПартнеры;
	Элементы.Контрагент.Видимость     =  КоммерческиеПредложенияДокументыКлиентСервер.ПолеКонтрагентВидимо(НастройкиУчета);

	Элементы.ТоварыХарактеристика.Видимость = НастройкиУчета.ИспользуютсяХарактеристикиНоменклатуры;

	Элементы.ТоварыПроцентАвтоматическойСкидки.Видимость   = НастройкиУчета.ИспользуютсяАвтоматическиеСкидкиВПродажах;
	Элементы.ТоварыСуммаАвтоматическойСкидки.Видимость     = НастройкиУчета.ИспользуютсяАвтоматическиеСкидкиВПродажах;
	Элементы.ТоварыРассчитатьСкидки.Видимость              = НастройкиУчета.ИспользуютсяАвтоматическиеСкидкиВПродажах;
	Элементы.ТоварыНазначитьАвтоматическиеСкидки.Видимость = НастройкиУчета.ИспользуютсяАвтоматическиеСкидкиВПродажах
	                                                         И НастройкиУчета.ИспользуютсяНазначаемыеАвтоматическиеСкидкиВПродажах;

	Элементы.ТоварыПроцентРучнойСкидки.Видимость   = НастройкиУчета.ИспользуютсяРучныеСкидкиВПродажах;
	Элементы.ТоварыСуммаРучнойСкидки.Видимость     = НастройкиУчета.ИспользуютсяРучныеСкидкиВПродажах;
	Элементы.ТоварыНазначитьРучнуюСкидку.Видимость = НастройкиУчета.ИспользуютсяРучныеСкидкиВПродажах;
	Элементы.ТоварыОтменитьРучныеСкидки.Видимость  = НастройкиУчета.ИспользуютсяРучныеСкидкиВПродажах;

	Элементы.ТоварыОткрытьИнформациюОСкидках.Видимость = (НастройкиУчета.ИспользуютсяРучныеСкидкиВПродажах
	                                                      Или НастройкиУчета.ИспользуютсяАвтоматическиеСкидкиВПродажах)
	                                                      И НастройкиУчета.РеализованаФормаПросмотраСкидок;

	Элементы.ТоварыЗаполнитьЦеныПоУсловиямПродаж.Видимость = НастройкиУчета.РеализованоЗаполнениеЦенПоУсловиямПродаж;
	Элементы.ТоварыЗаполнитьЦеныПоВидуЦен.Видимость        = НастройкиУчета.ИспользуютсяВидыЦен
	                                                         И НастройкиУчета.РеализованоЗаполнениеЦенПоВидамЦен;
	Элементы.ТоварыВидЦены.Видимость                       = НастройкиУчета.ИспользуютсяВидыЦен;

	ЕстьСкидки        = НастройкиУчета.ИспользуютсяРучныеСкидкиВПродажах Или НастройкиУчета.ИспользуютсяАвтоматическиеСкидкиВПродажах;
	ЕстьЗаполнениеЦен = НастройкиУчета.РеализованоЗаполнениеЦенПоУсловиямПродаж Или НастройкиУчета.РеализованоЗаполнениеЦенПоВидамЦен;

	Если ЕстьСкидки И Не ЕстьЗаполнениеЦен Тогда
		Элементы.ГруппаЦеныСкидки.Заголовок = НСтр("ru = 'Скидки'");
	ИначеЕсли ЕстьЗаполнениеЦен И Не ЕстьСкидки Тогда
		Элементы.ГруппаЦеныСкидки.Заголовок = НСтр("ru = 'Цены'");
	КонецЕсли;

	Элементы.ЗаполнитьУсловияОплаты.Видимость   = НастройкиУчета.РеализованоЗаполнениеУсловийОплаты;
	Элементы.ЗаполнитьУсловияДоставки.Видимость = НастройкиУчета.РеализованоЗаполнениеУсловийДоставки;

	Элементы.ДекорацияПустаяПрочиеУсловияПоставки.Видимость = НастройкиУчета.РеализованоЗаполнениеУсловийОплаты
	                                                          И НастройкиУчета.РеализованоЗаполнениеУсловийДоставки;

	Элементы.ТоварыЗапросСрокПоставкиПредставление.Видимость = ПоЗапросу И УказанХотяБыОдинСрокПоставки;

	КоммерческиеПредложенияДокументыКлиентСервер.УправлениеКолонкойСрокПоставки(Объект.ВариантУказанияСрокаПоставки, Элементы.ТоварыСрокПоставки, Элементы.УказатьСрокПоставки);
	КоммерческиеПредложенияДокументыКлиентСервер.ОчиститьСрокПоставкиЕслиНеСоответствуетВарианту(Объект.Товары, "СрокПоставки", Объект.ВариантУказанияСрокаПоставки);

	СформироватьПредставлениеДокументаОснования();

	Если НастройкиУчета.ИспользуютсяСтатусыКоммерческихПредложенийКлиентам Тогда
		КоммерческиеПредложенияДокументыКлиентСерверПереопределяемый.СформироватьПредставлениеСостоянияПоСтатусу(ЭтотОбъект, Объект.Статус, ТекущаяДатаСеанса());
	КонецЕсли;

	Элементы.Товары.ИзменятьПорядокСтрок = Не ПоЗапросу;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТоварыПереместить", "Видимость", Не ПоЗапросу);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТоварыПереместить1", "Видимость", Не ПоЗапросу);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТоварыКонтекстноеМенюПереместить", "Видимость", Не ПоЗапросу);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТоварыСортировка", "Видимость", Не ПоЗапросу);
КонецПроцедуры
